-- thanks to @aigiz010 for the translation!
local enhance_localization = {
    m_coal = {
        name = "Угольная карта",
            text = {
               "{C:chips}#1#{} фишек и {C:mult}#2#{} множ.",
               "{C:chips}+#3#{} фишек и {C:mult}+#4#{} множ.",
               "каждый раз, когда",
               "нет достоинства или масти",
   },
   },
   m_blank = {
        name = "Пустая карта",
            text = {
               "Копирует {C:attention}достоинство{} и {C:attention}масть{}",
               "карты справа от нее",
   },
   },
   m_wooden = {
        name = "Деревянная карта",
            text = {
               "{X:mult,C:white} X#1# {} множ.",
               "шанс {C:green}#2# из #3#{}",
               "не дать {C:mult}множ.{} или {C:chips}фишки{}",
               "при подсчете."
   },
   },
   m_brass = {
        name = "Латунная карта",
            text = {
               "{X:chips,C:white} X#1# {} фишек,",
               "когда эта карта",
               "остается в руке",
   },
   },
   m_bonus_rev = {
        name = "Ручная бонусная карта",
            text = {
               "{C:chips}+#1#{} фишек",
               "когда эта карта",
               "остается в руке",
   },
   },
   m_mult_rev = {
        name = "Ручная карта множителя",
            text = {
               "{C:mult}+#1#{} множ.",
               "когда эта карта",
               "остается в руке",
   },
   },
   m_fools_gold = {
        name = "Дуратская золотая карта",
            text = {
               "{C:chips}+#1#{} фишек и {C:mult}+#2#{} множ.",
               "когда эта карта",
               "остается в руке, но",
               "{C:money}$#3#{} если эта",
               "карта остается в руке",
               "в конце раунда",
   },
   },
   m_unlucky = {
        name = "Несчастливая карта",
            text = {
               "{X:mult,C:white} X#6# {} множ.",
               "Шанс {C:green}#1# из #3#{}",
               "дать {C:mult}#2#{} множ.",
               "Шанс{C:green}#1# из #5#{}",
               "потерять {C:money}$#4#",
   },
   },
}
return enhance_localization